app/controllers/logs_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`user_id` = 1 LIMIT 1
SELECT  `team_master`.* FROM `team_master` WHERE `team_master`.`team_id` = 1 LIMIT 1
---
  def top
    # ユーザ情報取得
    @userInfo = User.find(params[:user_id])

    # お気に入りを配列に詰める
    favoArry = [@userInfo.favorite1, @userInfo.favorite2, @userInfo.favorite3]

    # お気に入りがnullの場合、配列から削除
    favoArry.delete_if {|n| n == nil }

    # チームマスタからお気に入り画像を取得
    @logoArry = Array.new
    favoArry.each do |favo|
        @logoArry << TeamMaster.find_by(team_id:favo).team_logo_url

SELECT  `users_logs`.* FROM `users_logs` WHERE `users_logs`.`user_id` = '1' LIMIT 1
---
    # 全チーム取得

    # 観戦履歴取得
    @userLogs = UsersLog.where(user_id:params[:user_id])