app/controllers/logs_controller.rb

  def top
    # ユーザ情報取得
    @userInfo = User.find(params[:user_id])

    # お気に入りを配列に詰める
    favoList = [@userInfo.favorite1, @userInfo.favorite2, @userInfo.favorite3]

    # お気に入りがnilの場合、配列から削除
    favoList.delete_if {|n| n == nil }

    # チームマスタからお気に入り画像を取得
    @logoList = Array.new
    favoList.each do |favo|
        @logoList << AllTeam.find_by(id:favo).team_logo_url
---
SELECT  `all_teams`.* FROM `all_teams` WHERE `all_teams`.`id` = 1 LIMIT 1