app/controllers/select_controller.rb

  def top
    # TeamMasterインスタンスの取得
    @teams = TeamMaster.all
---
SELECT `team_master`.* FROM `team_master`