app/controllers/select_controller.rb

SELECT `all_teams`.* FROM `all_teams`
---
  def top
    # TeamMasterインスタンスの取得
    @teams = AllTeam.all